lambda/src/test/resources/model/AmendmentData/A-S02059070/subscription.json

{
  "success": true,
  "id": "SUBSCRIPTION-ID",
  "accountId": "ACCOUNT-ID",
  "accountNumber": "ACCOUNT-NUMBER",
  "accountName": "ACCOUNT-NAME",
  "invoiceOwnerAccountId": "ACCOUNT-ID",
  "invoiceOwnerAccountNumber": "ACCOUNT-NUMBER",
  "invoiceOwnerAccountName": "ACCOUNT-NAME",
  "subscriptionNumber": "A-S02059070",
  "version": 8,
  "revision": "8.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2024-01-10",
  "serviceActivationDate": "2024-01-10",
  "customerAcceptanceDate": "2024-01-19",
  "subscriptionStartDate": "2024-01-10",
  "subscriptionEndDate": "2027-01-10",
  "lastBookingDate": "2025-03-04",
  "termStartDate": "2026-01-10",
  "termEndDate": "2027-01-10",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 15.0,
  "totalContractedValue": 507.21,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "31a67945-9fc6-1d2d-0000-000000008939",
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "GWSTUDENT",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": "GWSTUDENT",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": {
    "country": "United Kingdom"
  },
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a1295df953c8da401956151208f5b2a",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a00d6f9de7f6016f9f6f52765aa4",
      "productRatePlanNumber": "PRP-00000136",
      "ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - GW",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-06248838",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a1295df953c8da40195615120c65b2b",
          "originalChargeId": "8a1295df953c8da40195615120c65b2b",
          "productRatePlanChargeId": "2c92a00d6f9de7f6016f9f6f529e5aaf",
          "number": "C-06478297",
          "name": "Delivery-problem credit",
          "productRatePlanChargeNumber": "PRPC-00000207",
          "type": "OneTime",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": null,
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2025-03-19",
          "effectiveEndDate": "2025-03-20",
          "processedThroughDate": "2025-03-20",
          "chargedThroughDate": "2025-03-20",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -3.75,
          "dtcv": -3.75,
          "originalOrderDate": "2025-03-04",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2025-02-28",
          "HolidayEnd__c": "2025-02-28",
          "ForceSync__c": null,
          "salesPrice": -3.75,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP-3.75",
          "price": -3.75,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a1295df953c8da401956151215f5b45",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a00d6f9de7f6016f9f6f52765aa4",
      "productRatePlanNumber": "PRP-00000136",
      "ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - GW",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-06248837",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a1295df953c8da40195615121635b47",
          "originalChargeId": "8a129126953c8da6019561510e1f1217",
          "productRatePlanChargeId": "2c92a00d6f9de7f6016f9f6f529e5aaf",
          "number": "C-06478296",
          "name": "Delivery-problem credit",
          "productRatePlanChargeNumber": "PRPC-00000207",
          "type": "OneTime",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": null,
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2025-03-19",
          "effectiveEndDate": "2025-03-20",
          "processedThroughDate": "2025-03-20",
          "chargedThroughDate": "2025-03-20",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -3.75,
          "dtcv": -3.75,
          "originalOrderDate": "2025-03-04",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2025-02-21",
          "HolidayEnd__c": "2025-02-21",
          "ForceSync__c": null,
          "salesPrice": -3.75,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP-3.75",
          "price": -3.75,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a1295df953c8da40195615121675b4a",
      "lastChangeType": "Remove",
      "productId": "2c92a0ff6619bf8901661aa3247c4b1d",
      "productName": "Guardian Weekly - Domestic",
      "productSku": "ABC-00000029",
      "productRatePlanId": "2c92a0fd79ac64b00179ae3f9d474960",
      "productRatePlanNumber": "PRP-00000163",
      "ratePlanName": "GW Oct 18 - Monthly - Domestic",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-04947554",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a1295df953c8da401956151216a5b4c",
          "originalChargeId": "8a1282048cd9a263018cf510e6a5785e",
          "productRatePlanChargeId": "2c92a0fd79ac64b00179ae3f9d704962",
          "number": "C-04966944",
          "name": "GW Oct 18 - Monthly - Domestic",
          "productRatePlanChargeNumber": "PRPC-00000263",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 4,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-01-19",
          "effectiveEndDate": "2025-03-19",
          "processedThroughDate": "2025-03-19",
          "chargedThroughDate": "2025-03-19",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 13.75,
          "dmrc": 0.0,
          "tcv": 192.5,
          "dtcv": -298.508064511,
          "originalOrderDate": "2024-01-10",
          "amendedByOrderOn": "2025-01-29",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 13.75,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP13.75",
          "price": 13.75,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a1295df953c8da401956151216e5b54",
      "lastChangeType": "Add",
      "productId": "2c92a0ff6619bf8901661aa3247c4b1d",
      "productName": "Guardian Weekly - Domestic",
      "productSku": "ABC-00000029",
      "productRatePlanId": "2c92a0fd79ac64b00179ae3f9d474960",
      "productRatePlanNumber": "PRP-00000163",
      "ratePlanName": "GW Oct 18 - Monthly - Domestic",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-06118137",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a1295df953c8da40195615121715b56",
          "originalChargeId": "8a12985c9498e8af0194b0df09b72f85",
          "productRatePlanChargeId": "2c92a0fd79ac64b00179ae3f9d704962",
          "number": "C-06346435",
          "name": "GW Oct 18 - Monthly - Domestic",
          "productRatePlanChargeNumber": "PRPC-00000263",
          "type": "Recurring",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2025-03-19",
          "effectiveEndDate": "2027-01-10",
          "processedThroughDate": "2025-06-19",
          "chargedThroughDate": "2025-07-19",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 15.0,
          "dmrc": 15.0,
          "tcv": 325.645161285,
          "dtcv": 325.645161285,
          "originalOrderDate": "2025-01-29",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": 15.0,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP15",
          "price": 15.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a1295df953c8da40195615121745b59",
      "lastChangeType": "Add",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a00d6f9de7f6016f9f6f52765aa4",
      "productRatePlanNumber": "PRP-00000136",
      "ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - GW",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05315948",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a1295df953c8da40195615121785b5b",
          "originalChargeId": "8a129b368f1000b4018f42fadc536f58",
          "productRatePlanChargeId": "2c92a00d6f9de7f6016f9f6f529e5aaf",
          "number": "C-05562613",
          "name": "Delivery-problem credit",
          "productRatePlanChargeNumber": "PRPC-00000207",
          "type": "OneTime",
          "model": "FlatFee",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": null,
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": null,
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": null,
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": null,
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-05-19",
          "effectiveEndDate": "2024-05-20",
          "processedThroughDate": "2024-05-20",
          "chargedThroughDate": "2024-05-20",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "One_Time",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": null,
          "dmrc": null,
          "tcv": -3.44,
          "dtcv": 0.0,
          "originalOrderDate": "2024-05-04",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": "2024-05-03",
          "HolidayEnd__c": "2024-05-03",
          "ForceSync__c": null,
          "salesPrice": -3.44,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP-3.44",
          "price": -3.44,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a1295df953c8da401956151217b5b60",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0ff5345f9220153559d915d5c26",
      "productRatePlanNumber": "PRP-00000048",
      "ratePlanName": "Percentage",
      "subscriptionProductFeatures": [

      ],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-04947553",
      "isFromExternalCatalog": false,
      "ratePlanCharges": [
        {
          "id": "8a1295df953c8da401956151217e5b62",
          "originalChargeId": "8a1282048cd9a263018cf510e68b7859",
          "productRatePlanChargeId": "2c92a0fd5345efa10153559e97bb76c6",
          "number": "C-04966943",
          "name": "Percentage",
          "productRatePlanChargeNumber": "PRPC-00000044",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "originalListPrice": null,
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "applyToBillingPeriodPartially": false,
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-01-19",
          "effectiveEndDate": "2024-04-19",
          "processedThroughDate": "2024-03-19",
          "chargedThroughDate": "2024-04-19",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 3,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2024-01-10",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "taxable": null,
          "taxCode": null,
          "taxMode": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "70%  discount",
          "price": null,
          "discountAmount": null,
          "discountPercentage": 70.0
        }
      ]
    }
  ],
  "orderNumber": "O-04141931",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2024-01-10",
      "endDate": "2027-01-10",
      "status": "Active"
    },
    {
      "startDate": "2027-01-10",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2025-03-04 13:21:01",
  "updateTime": "2025-06-19 04:01:27",
  "scheduledCancelDate": null,
  "scheduledSuspendDate": null,
  "scheduledResumeDate": null
}
